// // Arrays
// let numbers =[10,20,30,40,50];

// //خواندن
// numbers[2] //30 //O(1) 

// //تغییر مقدار
// numbers[0] = 5; //O(1) 

// //اضافه کردن در انتها
// numbers.push(60); //O(1)

// //حذف از انتها
// numbers.pop(); //O(1)

// //اضافه کردن در ابتدا
// numbers.unshift(1); //O(n)

// //حذف از ابتدا
// numbers.shift(); //O(n)


// //----------تمرین پیمایش Traversal
// let arr =[10,20,30,40,50];
// for (let i = arr.length-1; i >= 0; i--){
//     console.log(arr[i])
// }


//تمرین: یک آرایه داینامیک پیاده سازی کن که قادر به درج حذف یافتن و چاپ عناصر باشه